'use client';
import React from 'react';
import { motion } from 'framer-motion';
import Link from 'next/link';
import type { Metadata } from 'next';
import Header from "components/header";
import Footer from "components/footer";




const about: React.FC = () => {
    const fadeInAnimation = {
      initial: { opacity: 0, y: 50 },
      animate: { opacity: 1, y: 0 },
      exit: { opacity: 0, y: 50 },
      transition: { duration: 0.8 }, // Set the duration here (in seconds)
    };
    return (
          <motion.div {...fadeInAnimation}>
            <Header />
            <motion.div className="max-w-screen-xl mx-auto py-12 px-4 sm:px-6 lg:px-8" {...fadeInAnimation}>
              <motion.div className="grid grid-cols-1 md:grid-cols-3 gap-8" {...fadeInAnimation}>
                {/* Content on the left */}
                <motion.div className="col-span-2" {...fadeInAnimation}>
                  {/* Item 01 */}
                  <motion.div className="flex items-center mt-5 md:mb-0" {...fadeInAnimation}>
                    <div className="border-2 border-solid border-[#2a6f97] text-[#2a6f97] bg-transparent p-6 rounded-lg shadow-lg w-[600px]">
                      <span className="text-4xl font-bold mb-4 block">Какая скорость интернета мне нужна?</span>
                      Для эффективного проведения стриминга, игр, загрузки файлов и проведения онлайн-видеозвонков с минимальными задержками и буферизацией, вам потребуется скорость загрузки не менее 25 Мбит/с и скорость выгрузки не менее 3 Мбит/с. Однако, если вы живете с троими или более людьми, вам лучше выбрать скорость загрузки 100 Мбит/с и скорость выгрузки 10 Мбит/с, чтобы поддерживать больше пользователей и задач, требующих большей полосы пропускания.
                    </div>
                  </motion.div>
      
                  {/* Item 02 */}
                  <motion.div className="flex items-center mt-5 md:mb-0" {...fadeInAnimation}>
                    <div className="border-2 border-solid border-[#2a6f97] text-[#2a6f97] bg-transparent p-6 rounded-lg shadow-lg w-[600px]">
                      <span className="text-4xl font-bold mb-4 block">Какой интернет самый быстрый?</span>
                      Оптоволоконный интернет является самым быстрым типом подключения к интернету. Он использует кабели из связанных оптоволоконных волокон для передачи больших объемов данных с помощью световых сигналов. Большинство тарифных планов по оптоволоконному интернету предоставляют скорость 1,000 Мбит/с, хотя некоторые поставщики могут предложить скорости до 2,000 Мбит/с или даже 5,000 Мбит/с. Оптоволокно также единственный тип интернета, предоставляющий симметричные скорости выгрузки, поэтому ваша загрузка будет такой же быстрой, как и скачивание.                    </div>
                  </motion.div>
      
                  {/* Item 03 */}
                  <motion.div className="flex items-center mt-5 md:mb-0" {...fadeInAnimation}>
                    <div className="border-2 border-solid border-[#2a6f97] text-[#2a6f97] bg-transparent p-6 rounded-lg shadow-lg w-[600px]">
                      <span className="text-4xl font-bold mb-4 block">Почему мой интернет такой медленный?</span>
                      Ваш интернет может работать медленно по многим причинам. Возможно, ваш тарифный план интернета слишком медленный для ваших потребностей, ваш модем или маршрутизатор может быть устаревшим, ваш маршрутизатор может быть неисправным, или слишком много людей одновременно использует вашу беспроводную сеть Wi-Fi.                    </div>
                  </motion.div>
      
                  {/* Item 04 */}
                  <motion.div className="flex items-center mt-5 md:mb-0" {...fadeInAnimation}>
                    <div className="border-2 border-solid border-[#2a6f97] text-[#2a6f97] bg-transparent p-6 rounded-lg shadow-lg w-[600px]">
                      <span className="text-4xl font-bold mb-4 block">Как сделать мой интернет быстрее?</span>
                      Вы можете улучшить скорость вашего интернета, перейдя на более быстрый тарифный план, обновив ваше оборудование или приняв более простые меры, такие как закрытие приложений и окон браузера.                     </div>
                  </motion.div>
                </motion.div>
                <motion.div className="col-span-1 hidden md:block">
                  <svg width="465" height="1000" viewBox="0 0 722 1385" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M301.286 191.742C291.241 170.616 286.972 146.881 294.958 123.706C317.967 56.9339 408.686 97.2874 417.91 136.572C427.134 175.856 401.6 262.393 376.14 262.15C365.986 262.053 347.36 250.635 330.094 232.706L318.518 327.61L242.199 307.161L301.286 191.742Z" fill="#D4A181"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M328.982 194.034C314.65 209.664 297.896 219.837 284.819 216.334C259.982 209.678 251.22 171.739 260.786 136.036C261.122 134.782 261.481 133.542 261.862 132.318C230.757 143.308 200.986 173.421 166.221 164.106C118.925 151.433 125.703 51.0019 191.783 68.708C236.723 80.7495 257.072 93.2249 273.527 108.019C280.123 98.4327 288.238 91.062 296.911 86.72C299.104 85.2743 302.175 84.1514 305.959 83.3618C308.296 82.7928 310.648 82.4498 312.999 82.3472C325.62 81.2035 343.059 82.6846 361.822 87.0163C365.325 87.8252 368.744 88.7031 372.057 89.6389C376.805 72.1373 394.821 61.7638 412.35 66.4606C429.912 71.1664 440.335 89.2182 435.629 106.78C431.078 123.765 414.045 134.071 397.044 130.475C386.663 130.864 373.762 129.736 359.855 126.991C359.844 132.334 359.047 138.194 357.331 144.598C355.816 150.252 353.585 156.082 350.804 161.863C348.785 157.547 345.439 154.187 341.417 153.109C330.168 150.095 319.858 157.251 317.225 167.077C313.884 179.547 318.666 190.497 328.982 194.034Z" fill="#E0C68E"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M144.853 598.187L265.445 1013.74L322.166 1325.74H379.096L322.267 598.187H144.853Z" fill="#BA8B72"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M90.6568 598.187C99.0713 814.064 95.7527 931.809 93.8695 951.423C91.9862 971.036 81.2947 1102.39 8.4397 1332.33H67.6524C164.137 1111.74 197.819 980.388 208.885 951.423C219.951 922.458 252.634 804.712 300.349 598.187H90.6568Z" fill="#D4A181"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M142.264 598.187C173.632 741.18 227.885 969.432 305.023 1282.94H388.291C394.441 961.154 368.278 749.362 322.971 598.187H142.264Z" fill="#1A1A1A"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M90.2362 598.187C98.4772 814.064 77.1203 1026.74 10.9644 1286.31H99.806C196.468 1069.02 265.748 857.386 313.097 598.187H90.2362Z" fill="#1A1A1A"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M0 1375.12L3.26716 1322.45C22.3959 1328.04 46.3551 1325.85 75.1446 1315.87C106.1 1337.79 145.07 1352.77 192.052 1360.78C195.637 1361.4 198.047 1364.8 197.435 1368.38C197.395 1368.61 197.343 1368.84 197.279 1369.07L192.762 1385H75.1446H6.53431L0 1375.12Z" fill="#0A496E"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M309.458 1375.12L312.725 1322.45C331.854 1328.04 355.813 1325.85 384.602 1315.87C415.558 1337.79 454.527 1352.77 501.51 1360.78C505.094 1361.4 507.504 1364.8 506.893 1368.38C506.853 1368.61 506.801 1368.84 506.737 1369.07L502.22 1385H384.602H315.992L309.458 1375.12Z" fill="#0A496E"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M380.406 413.117L503.806 371.326C526.438 352.404 547.919 338.396 568.25 329.304C574.208 327.965 584.161 328.274 572.244 342.783C560.327 357.292 548.445 373.09 552.194 378.868C555.942 384.647 568.695 379.747 572.758 388.965C575.466 395.111 554.236 400.322 509.068 404.598L414.098 465.048L380.406 413.117ZM547.483 496.196L601.702 477.758C613.291 452.589 623.924 440.772 633.599 442.308C641.617 440.167 622.832 471.239 637.389 470.824C651.946 470.409 690.728 450.955 695.723 457.174C703.112 466.375 691.172 488.52 679.927 498.601C658.91 517.441 643.383 522.413 606.538 526.013C587.273 527.895 565.611 534.657 541.552 546.298L547.483 496.196Z" fill="#D4A181"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M328.023 389.724C367.513 396.257 421.542 397.2 483.903 371.49L497.267 424.491C451.813 456.061 391.856 478.013 344.53 468.291C307.234 460.63 296.072 411.915 328.023 389.724Z" fill="#2A6F97"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M367.208 477.852C407.213 495.666 479.554 495.732 584.232 478.051C599.751 532.903 604.691 570.929 599.053 592.128C506.773 621.367 430.883 628.276 370.988 619.054C366.642 654.792 356.393 687.719 336.49 715.947C295.572 773.979 131.644 684.648 71.0184 685.852C55.3379 560.22 134.822 524.303 148.323 448.066C163.109 364.579 252.816 247.877 262.68 249.617L352.638 265.479C346.357 330.123 358.948 404.806 367.208 477.852Z" fill="#2A6F97"/>
                      </svg>
                  </motion.div>
        </motion.div>
      </motion.div>
      <Footer />
    </motion.div>
  );

};
export default about;

